OpenNuvoton/M55M1BSP/SampleCode/StdDriver/LPI2C_LPPDMA_TRX/main.c
void LPPDMA_Master_Init(void)
{
    /* Open PDMA Channel */
    LPPDMA_Open(LPPDMA, 1 << LPI2C0_LPPDMA_TX_CH_MASTER); // Channel 0 for LPI2C0 TX
    LPPDMA_Open(LPPDMA, 1 << LPI2C0_LPPDMA_RX_CH_MASTER); // Channel 2 for LPI2C0 RX
    // Select basic mode
    LPPDMA_SetTransferMode(LPPDMA, LPI2C0_LPPDMA_TX_CH_MASTER, LPPDMA_LPI2C0_TX, 0, 0);
    LPPDMA_SetTransferMode(LPPDMA, LPI2C0_LPPDMA_RX_CH_MASTER, LPPDMA_LPI2C0_RX, 0, 0);
    // Set data width and transfer count
    LPPDMA_SetTransferCnt(LPPDMA, LPI2C0_LPPDMA_TX_CH_MASTER, LPPDMA_WIDTH_8, LPPDMA_TEST_LENGTH);
    LPPDMA_SetTransferCnt(LPPDMA, LPI2C0_LPPDMA_RX_CH_MASTER, LPPDMA_WIDTH_8, LPPDMA_TEST_LENGTH - 3); // except Slave Address and two bytes Data Address
    //Set PDMA Transfer Address
    LPPDMA_SetTransferAddr(LPPDMA, LPI2C0_LPPDMA_TX_CH_MASTER, ((uint32_t)(&g_u8MasterTx_Buffer[0])), LPPDMA_SAR_INC, (uint32_t)(&(LPI2C0->DAT)), LPPDMA_DAR_FIX);
    LPPDMA_SetTransferAddr(LPPDMA, LPI2C0_LPPDMA_RX_CH_MASTER, (uint32_t)(&(LPI2C0->DAT)), LPPDMA_SAR_FIX, ((uint32_t)(&g_u8MasterRx_Buffer[0])), LPPDMA_DAR_INC);
    //Select Single Request
    LPPDMA_SetBurstType(LPPDMA, LPI2C0_LPPDMA_TX_CH_MASTER, LPPDMA_REQ_SINGLE, 0);
    LPPDMA_SetBurstType(LPPDMA, LPI2C0_LPPDMA_RX_CH_MASTER, LPPDMA_REQ_SINGLE, 0);
    LPPDMA_EnableInt(LPPDMA, LPI2C0_LPPDMA_TX_CH_MASTER, LPPDMA_INT_TRANS_DONE);
    LPPDMA_EnableInt(LPPDMA, LPI2C0_LPPDMA_RX_CH_MASTER, LPPDMA_INT_TRANS_DONE);
    NVIC_EnableIRQ(LPPDMA_IRQn);
}

void LPPDMA_Slave_Init(void)
{
    /* Open PDMA Channel */
    LPPDMA_Open(LPPDMA, 1 << LPI2C0_LPPDMA_RX_CH_SLAVE); // Channel 1 for LPI2C0 RX
    LPPDMA_Open(LPPDMA, 1 << LPI2C0_LPPDMA_TX_CH_SLAVE); // Channel 3 for LPI2C0 TX
    // Select basic mode
    LPPDMA_SetTransferMode(LPPDMA, LPI2C0_LPPDMA_RX_CH_SLAVE, LPPDMA_LPI2C0_RX, 0, 0);
    LPPDMA_SetTransferMode(LPPDMA, LPI2C0_LPPDMA_TX_CH_SLAVE, LPPDMA_LPI2C0_TX, 0, 0);
    // Set data width and transfer count
    LPPDMA_SetTransferCnt(LPPDMA, LPI2C0_LPPDMA_RX_CH_SLAVE, LPPDMA_WIDTH_8, LPPDMA_TEST_LENGTH);
    LPPDMA_SetTransferCnt(LPPDMA, LPI2C0_LPPDMA_TX_CH_SLAVE, LPPDMA_WIDTH_8, LPPDMA_TEST_LENGTH - 3); // except Slave Address and two bytes Data Address
    //Set PDMA Transfer Address
    LPPDMA_SetTransferAddr(LPPDMA, LPI2C0_LPPDMA_RX_CH_SLAVE, (uint32_t)(&(LPI2C0->DAT)), LPPDMA_SAR_FIX, ((uint32_t)(&g_u8SlaveRx_Buffer[0])), LPPDMA_DAR_INC);
    LPPDMA_SetTransferAddr(LPPDMA, LPI2C0_LPPDMA_TX_CH_SLAVE, ((uint32_t)(&g_u8SlaveTx_Buffer[0])), LPPDMA_SAR_INC, (uint32_t)(&(LPI2C0->DAT)), LPPDMA_DAR_FIX);
    //Select Single Request
    LPPDMA_SetBurstType(LPPDMA, LPI2C0_LPPDMA_RX_CH_SLAVE, LPPDMA_REQ_SINGLE, 0);
    LPPDMA_SetBurstType(LPPDMA, LPI2C0_LPPDMA_TX_CH_SLAVE, LPPDMA_REQ_SINGLE, 0);
    LPPDMA_EnableInt(LPPDMA, LPI2C0_LPPDMA_RX_CH_SLAVE, LPPDMA_INT_TRANS_DONE);
    LPPDMA_EnableInt(LPPDMA, LPI2C0_LPPDMA_TX_CH_SLAVE, LPPDMA_INT_TRANS_DONE);
    NVIC_EnableIRQ(LPPDMA_IRQn);
}

void LPI2C_LPPDMA_Master(void)
{
    uint32_t i, u32TimeOutCnt;

    for (i = 0; i < LPPDMA_TEST_LENGTH; i++)
    {
        g_u8MasterTx_Buffer[i] = i;
        g_u8MasterRx_Buffer[i] = 0xff;
    }

    g_u8MasterTx_Buffer[0] = ((g_u8DeviceAddr << 1) | 0x00);   //1 byte SLV + W
    g_u8MasterTx_Buffer[1] = 0x00;                             //2 bytes Data address
    g_u8MasterTx_Buffer[2] = 0x00;
#if (NVT_DCACHE_ON == 1)
    /*
        Clean the CPU Data cache before starting the DMA transfer.
        This guarantees that the source buffer will be up to date before starting the transfer.
    */
    SCB_CleanDCache_by_Addr(g_u8MasterTx_Buffer, sizeof(g_u8MasterTx_Buffer));
    SCB_CleanDCache_by_Addr(g_u8MasterRx_Buffer, sizeof(g_u8MasterRx_Buffer));
#endif  // (NVT_DCACHE_ON == 1)
    LPPDMA_Master_Init();
    /* Enable I2C TX */
    LPI2C0->CTL1 = LPI2C_CTL1_TXPDMAEN_Msk;
    s_LPI2C0HandlerFn = (LPI2C_FUNC)LPI2C_LPPDMA_MasterTx;
    LPPDMA_DONE = 0;
    /* Send START condition, start the LPPDMA data transmit */
    LPI2C_START(LPI2C0);
    u32TimeOutCnt = LPI2C_TIMEOUT;

    while (!LPPDMA_DONE)
    {
        if (--u32TimeOutCnt == 0)
        {
            printf("Wait MasterTx done time-out!\n");

            while (1);
        }
    }

    printf("Wait slave receive data done and then press any key to start master LPPDMA RX mode.\n\n");
    getchar();
    /* Disable LPI2C0 LPPDMA TX mode */
    LPI2C0->CTL1 &= ~LPI2C_CTL1_TXPDMAEN_Msk;
    /* Test Master RX with LPPDMA function */
    /* LPI2C0 function to Master receive data */
    s_LPI2C0HandlerFn = (LPI2C_FUNC)LPI2C_LPPDMA_MasterRx;
    LPPDMA_DONE = 0;
    /* Send START condition */
    LPI2C_START(LPI2C0);
    u32TimeOutCnt = LPI2C_TIMEOUT;

    while (!LPPDMA_DONE)
    {
        if (--u32TimeOutCnt == 0)
        {
            printf("Wait MasterRx done time-out!\n");

            while (1);
        }
    }

    /* Disable LPI2C0 LPPDMA RX mode */
    LPI2C0->CTL1 &= ~LPI2C_CTL1_RXPDMAEN_Msk;
#if (NVT_DCACHE_ON == 1)
    /*
       Invalidate the CPU Data cache after the DMA transfer.
       As the destination buffer may be used by the CPU, this guarantees up-to-date data when CPU access
    */
    SCB_InvalidateDCache_by_Addr(g_u8MasterRx_Buffer, sizeof(g_u8MasterRx_Buffer));
#endif  // (NVT_DCACHE_ON == 1)

    for (i = 0; i < LPPDMA_TEST_LENGTH - 3; i++)
    {
        if (g_u8MasterRx_Buffer[i] != g_u8MasterTx_Buffer[i + 3])
        {
            printf(" Slave Receive Data Compare Error !!\n");

            while (1);
        }
    }

    printf("LPI2C LPPDMA test Pass.\n");
}

void LPI2C_LPPDMA_Slave(void)
{
    uint32_t i;

    for (i = 0; i < LPPDMA_TEST_LENGTH; i++)
    {
        g_u8MasterTx_Buffer[i] = i;
        g_u8SlaveRx_Buffer[i] = 0xff;
    }

    g_u8MasterTx_Buffer[0] = ((g_u8DeviceAddr << 1) | 0x00);   //1 byte SLV + W
    g_u8MasterTx_Buffer[1] = 0x00;                             //2 bytes Data address
    g_u8MasterTx_Buffer[2] = 0x00;
#if (NVT_DCACHE_ON == 1)
    /*
        Clean the CPU Data cache before starting the DMA transfer.
        This guarantees that the source buffer will be up to date before starting the transfer.
    */
    SCB_CleanDCache_by_Addr(g_u8MasterTx_Buffer, sizeof(g_u8MasterTx_Buffer));
    SCB_CleanDCache_by_Addr(g_u8SlaveRx_Buffer, sizeof(g_u8SlaveRx_Buffer));
#endif  // (NVT_DCACHE_ON == 1)
    LPPDMA_DONE = 0;
    LPPDMA_Slave_Init();
    /* LPI2C enter no address SLV mode */
    LPI2C_SET_CONTROL_REG(LPI2C0, LPI2C_CTL_SI | LPI2C_CTL_AA);
    /* Enable LPI2C0 LPPDMA RX mode */
    LPI2C0->CTL1 = LPI2C_CTL1_RXPDMAEN_Msk;
    /* LPI2C0 function to Slave receive data */
    s_LPI2C0HandlerFn = LPI2C_LPPDMA_SlaveRx;

    while (!LPPDMA_DONE);

    printf("LPI2C slave receive data done.\n\n");
    /* Disable LPI2C0 LPPDMA RX mode */
    LPI2C0->CTL1 &= ~LPI2C_CTL1_RXPDMAEN_Msk;
#if (NVT_DCACHE_ON == 1)
    /*
       Invalidate the CPU Data cache after the DMA transfer.
       As the destination buffer may be used by the CPU, this guarantees up-to-date data when CPU access
    */
    SCB_InvalidateDCache_by_Addr(g_u8SlaveRx_Buffer, sizeof(g_u8SlaveRx_Buffer));
#endif  // (NVT_DCACHE_ON == 1)

