OpenNuvoton/M55M1BSP/SampleCode/StdDriver/LPI2C_LPPDMA_TRX/main.c
    for (i = 0; i < LPPDMA_TEST_LENGTH; i++)
    {
        if (g_u8SlaveRx_Buffer[i] != g_u8MasterTx_Buffer[i])
        {
            printf(" Receive Data Compare Error !!\n");
            uint32_t j = 0;

            for (j = 0; j < LPPDMA_TEST_LENGTH; j++)
            {
                printf("(0x%02X, 0x%02X) ", g_u8SlaveRx_Buffer[j], g_u8MasterTx_Buffer[j]);
            }

            printf("\n");

            while (1);
        }
        else
        {
            if (i > 2)
            {
                g_u8SlaveTx_Buffer[i - 3] = g_u8MasterTx_Buffer[i];
            }
        }
    }

#if (NVT_DCACHE_ON == 1)
    /*
        Clean the CPU Data cache before starting the DMA transfer.
        This guarantees that the source buffer will be up to date before starting the transfer.
    */
    SCB_CleanDCache_by_Addr(g_u8SlaveTx_Buffer, sizeof(g_u8SlaveTx_Buffer));
#endif  // (NVT_DCACHE_ON == 1)
    /* Test Slave TX with LPPDMA function */
    printf("LPI2C slave wait to transmit data.\n");
    /* LPI2C0 function to Slave transmit data */
    s_LPI2C0HandlerFn = LPI2C_LPPDMA_SlaveTx;
}

/*---------------------------------------------------------------------------------------------------------*/
/*  Main Function                                                                                          */
/*---------------------------------------------------------------------------------------------------------*/
int32_t main(void)
{
    uint32_t u32Item;
    /* Init System, IP clock and multi-function I/O */
    SYS_Init();
    /* Init Debug UART to 115200-8N1 for print message */
    InitDebugUart();
#if defined (__GNUC__) && !defined(__ARMCC_VERSION) && defined(OS_USE_SEMIHOSTING)
    initialise_monitor_handles();
#endif
    /*
        This sample code sets I2C bus clock to 100kHz. Then, Master accesses Slave with Byte Write
        and Byte Read operations, and check if the read data is equal to the programmed data.
    */
    printf("+-------------------------------------------------------+\n");
    printf("|       LPI2C Driver Sample Code for LPPDMA             |\n");
    printf("|                                                       |\n");
    printf("|  LPI2C Master (LPI2C0) <---> LPI2C Slave(LPI2C0)      |\n");
    printf("+-------------------------------------------------------+\n");
    printf("|  Please select Master or Slave test                   |\n");
    printf("|  [0] Master    [1] Slave                              |\n");
    printf("+-------------------------------------------------------+\n\n");
    u32Item = (uint32_t)getchar();

    if (u32Item == '0')
    {
        /* Init LPI2C0 Master */
        LPI2C_Master_Init();
        LPI2C_LPPDMA_Master();
    }
    else
    {
        /* Init LPI2C0 Slave */
        LPI2C_Slave_Init();
        LPI2C_LPPDMA_Slave();
    }

    while (1);
}

/*** (C) COPYRIGHT 2023 Nuvoton Technology Corp. ***/
